<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Ledger Live</string>
		<key>Identifier</key>
		<string>com.github.jmarkIT.download.LedgerLive</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>LedgerLive</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://download.live.ledger.com/latest/mac</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Ledger Live.app</string>
					<key>requirement</key>
					<string>identifier "com.ledger.live" and anchor apple generic and certificate
						1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = X6LFS5BQKN</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>