<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download the latest version of Slite 
		
		Set ARCH input to architecture of choice 
		x64
		arm64</string>
		<key>Identifier</key>
		<string>com.github.jmarkIT.download.Slite</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Slite</string>
			<key>ARCH</key>
			<string>x64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://download.slite.com/mac/dmg/%ARCH%</string>
					<key>filename</key>
					<string>%NAME%-%ARCH%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Slite.app</string>
					<key>requirement</key>
					<string>identifier "com.slite.desktop" and anchor apple generic and certificate
						1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = MHBTUP38M7</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>